{
  "navbar": {
    "brand": "Utku • Portfolio",
    "home": "Home",
    "projects": "Projects",
    "bio": "Bio"
  },
  "home": {
    "title": "Home",
    "desc": ""
  },
  "bio": {
    "title": "About Me",
    "desc":"I was born in 2001, and when I was around 4 years old, my family bought me a computer with a CRT monitor and 512 MB of RAM. From that age on, I grew up with computers. I’m not sure if it was because I studied in a small town, but in middle school and high school, I never received any education related to computers. However, due to my interest, I was always the person people around me went to for advice when choosing a computer, and I was the first one they turned to when they had problems. As I progressed in life, I always thought that when I grew up, I would become a software developer, work with computers, and have a career where I would always be in front of a screen. With that goal in mind, I chose to study Mathematics at university. The biggest reason for choosing Mathematics was my interest in the subject and the computer-related courses in the curriculum. I also frequently came across positive comments stating that mathematics graduates made great software developers and that studying this field made working in software much easier. While studying Mathematics, I realized how both right and wrong those comments were. Although I did take courses in algorithms, data types, data structures, etc., I never really had the time to truly specialize in software development. I had to focus on mathematics and study mainly to pass my exams. Still, I always found something to work on related to software. The first programming language I started learning was C#, using an old book my uncle—who is a Computer Engineer living in the Netherlands—had sent me. I wrote a few “Hello World” programs and built a couple of calculators, but due to the irresponsibility of being a high school student, my C# journey ended there. Later, during my university years, I decided to learn C++ and stuck with it for a while. At the same time, I made several attempts to create games using Unreal Engine 4. Most recently, I decided to learn Data Science, and now I can use Python at an intermediate level, with solid skills in mathematical libraries like NumPy and SymPy. Over the years, I’ve also developed an interest in design. I’ve taught myself to use many design applications and have created numerous images, videos, logos, and more—and I continue to do so."
  },
  "projects": {
    "title": "Projects",
    "desc":"This is the projects page"
  }
}
