{
    "navbar" : {
        "home": "Ana Sayfa",
        "projects": "Projeler",
        "bio": "Hakkımda"
    
    },
    "home" : {
        "title": "Ana Sayfa",
        "desc": ""
    },
    "bio" : {
        "title": "Hakkımda",
        "desc": "2001 senesinde dünyaya geldim, 4 yaşlarında bana tüplü monitör ve 512mb ram'e sahip bir bilgisayar alındı ve o yaşlarda bilgisayar ile büyümeye başladım. Küçük bir ilçede okuduğumdan dolayı mı bilmem ama ortaokul ve lisede hiçbir zaman bilgisayar ile alakalı bir eğitim görmedim fakat ilgim dolayısıyla her zaman çevremdekilerin bilgisayar seçimlerini ben yapar, sorunları olduğunda ilk başvurdukları kişi olurdum. Bu şekilde ilerlerken hep büyüdüğümde yazılımcı olacağım, bilgisayar ile uğraşacak ve hep bilgisayar başında olacağım bir meslek ile hayatımı sürdüreceğim gibi bir karar verdim. Bu amaç uğrunda üniversitede matematik bölümünü tercih ettim. Matematik bölümünü tercih etmemdeki en büyük etken; matematiğe olan ilgim ve matematik bölümünde bulunan bilgisayar ile alakalı derslerdi. Ayrıca okuduğum her yerde matematik mezunlarının ne kadar iyi yazılımcı olduğu ve bu bölümü okumanın yazılım üzerinde çalışma yapmayı ne kadar kolaylaştırdığı yönünde olumlu eleştirileri bulunuyordu. Matematik bölümünü okurken aslında ne kadar haklı ve ne kadar haksız olduklarını anlamış bulundum, gerçekten her ne kadar algoritma, veri tipleri, veri yapıları vs. dersler görsem de hiçbir zaman gerçekten kendimi yazılım üzerinde uzmanlaştırabilmek için vakit bulamadım. Sadece sınavları geçebilmek için ders çalışmam ve matematik üzerinde yoğunlaşmam gerekiyordu. Her zaman yazılımla uğraşacak birşeyler buldum... İlk öğrenmeye başladığım yazılım dili C#'dı, Bilgisayar Mühendisi olan ve Hollanda'da yaşayan dayımın bana gönderdiği eski bir kitap ile C# öğrenmeye başladım... Birkaç Hello World, birkaç hesap makinesi üzerinde lisede olmanın verdiği sorumsuzluk ile C# serüvenim orada son buldu. Sonrasında üniversite yıllarımda verdiğim kararlar sonucunda C++ öğrenmeye başladım ve bir süre devam ettim. Aynı zamanda Unreal Engine 4 ile birçok oyun yapma girişiminde bulundum. En son verdiğim karar ile Veri Bilimi öğrenmeye başladım ve şuan orta yetkinlikte Python kullanabiliyor, Numpy, Sympy gibi matematiksel kütüphanelerde de yetkinliklerim var...  Bütün bu yıllar içerisinde yine hoşuma giden tasarıma da yoğunlaştım. Birçok tasarım uygulamasını kendi çabalarım ile öğrenip birçok resim, video, logo vs. yaptım ve yapmaya devam ediyorum.   "
    },
    "projects": {
        "title": "Projeler",
        "desc": "Burası projeler sayfası."
    }
}
